Revit 2027 API
RebarShapeConstraintProjectedSegmentLength.Direction Property
 A vector specifying the direction of the constraint. The direction is fixed, and the shape is always constructed so that the segment direction has a positive dot product with this vector.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV Direction { get; }
Public ReadOnly Property Direction As UV
	Get
public:
property UV^ Direction {
	UV^ get ();
}
member Direction : UV with get
Property Value
UV
See Also
Reference
RebarShapeConstraintProjectedSegmentLength Class
Autodesk.Revit.DB.Structure Namespace